`terraform plan -out plan.tfplan`

<details><summary>Show plan</summary>

```
Terraform will perform the following actions:

  # module.application.aws_autoscaling_group.app_server_asg will be created
  + resource "aws_autoscaling_group" "app_server_asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = true
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "app-server-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_maintenance_policy {
          + max_healthy_percentage = 150
          + min_healthy_percentage = 50
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = (known after apply)
        }
    }

  # module.application.aws_autoscaling_group.web_server_asg will be created
  + resource "aws_autoscaling_group" "web_server_asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = true
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "web-server-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_maintenance_policy {
          + max_healthy_percentage = 150
          + min_healthy_percentage = 50
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = (known after apply)
        }
    }

  # module.application.aws_iam_instance_profile.app_server_profile will be created
  + resource "aws_iam_instance_profile" "app_server_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "app-server-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "app-server-role"
      + tags_all    = {
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + unique_id   = (known after apply)
    }

  # module.application.aws_iam_instance_profile.web_server_profile will be created
  + resource "aws_iam_instance_profile" "web_server_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "web-server-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "web-server-role"
      + tags_all    = {
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + unique_id   = (known after apply)
    }

  # module.application.aws_iam_policy_attachment.ec2_web will be created
  + resource "aws_iam_policy_attachment" "ec2_web" {
      + id         = (known after apply)
      + name       = "web-server-ec2-read-only-attachment"
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess"
      + roles      = [
          + "web-server-role",
        ]
    }

  # module.application.aws_iam_policy_attachment.ssm_app will be created
  + resource "aws_iam_policy_attachment" "ssm_app" {
      + id         = (known after apply)
      + name       = "app-server-ssm-attachment"
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + roles      = [
          + "app-server-role",
        ]
    }

  # module.application.aws_iam_policy_attachment.ssm_web will be created
  + resource "aws_iam_policy_attachment" "ssm_web" {
      + id         = (known after apply)
      + name       = "web-server-ssm-attachment"
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + roles      = [
          + "web-server-role",
        ]
    }

  # module.application.aws_iam_role.app_server_role will be created
  + resource "aws_iam_role" "app_server_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-server-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + unique_id             = (known after apply)
    }

  # module.application.aws_iam_role.web_server_role will be created
  + resource "aws_iam_role" "web_server_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "web-server-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + unique_id             = (known after apply)
    }

  # module.application.aws_launch_template.app_launch_template will be created
  + resource "aws_launch_template" "app_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "The launch template for the app auto scaling group"
      + id                     = (known after apply)
      + image_id               = "ami-07d9b9ddc6cd8dd30"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = "app-server-asg-launch-template"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Name" = "app-server-asg-launch-templatee"
        }
      + tags_all               = {
          + "Name"        = "app-server-asg-launch-templatee"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + user_data              = "IyEvYmluL2Jhc2gKCnN1ZG8gYXB0IHVwZGF0ZQpzdWRvIGFwdCBpbnN0YWxsIHB5dGhvbjMuMTAtdmVudiAteQpweXRob24zIC1tIHZlbnYgdmVudgpzb3VyY2UgdmVudi9iaW4vYWN0aXZhdGUKYXB0IGluc3RhbGwgcHl0aG9uMy1waXAgLXkKcGlwIGluc3RhbGwgRmxhc2sKCmV4cG9ydCBGSUxFTkFNRT0iaGVsbG9fd29ybGQucHkiCgpiYXNoIC1jICJjYXQgPiAkRklMRU5BTUUiIDw8RU9GCmZyb20gZmxhc2sgaW1wb3J0IEZsYXNrCgphcHAgPSBGbGFzayhfX25hbWVfXykKCkBhcHAucm91dGUoJy8nKQpkZWYgaGVsbG9fd29ybGQoKToKICAgIHJldHVybiAnJycKICAgIDwhRE9DVFlQRSBodG1sPgogICAgPGh0bWw+CiAgICA8aGVhZD4KICAgICAgICA8bWV0YSBjaGFyc2V0PSJ1dGYtOCI+CiAgICAgICAgPHRpdGxlPkhlbGxvLCBXb3JsZCE8L3RpdGxlPgogICAgICAgIDxzdHlsZT4KICAgICAgICAgICAgYm9keSB7CiAgICAgICAgICAgICAgICBkaXNwbGF5OiBmbGV4OwogICAgICAgICAgICAgICAganVzdGlmeS1jb250ZW50OiBjZW50ZXI7CiAgICAgICAgICAgICAgICBhbGlnbi1pdGVtczogY2VudGVyOwogICAgICAgICAgICAgICAgaGVpZ2h0OiAxMDB2aDsKICAgICAgICAgICAgICAgIG1hcmdpbjogMDsKICAgICAgICAgICAgICAgIGJhY2tncm91bmQtY29sb3I6ICNmMGYwZjA7IC8qIExpZ2h0IGdyYXkgYmFja2dyb3VuZCAqLwogICAgICAgICAgICB9CiAgICAgICAgICAgIC5jb250ZW50IHsKICAgICAgICAgICAgICAgIHRleHQtYWxpZ246IGNlbnRlcjsKICAgICAgICAgICAgICAgIGNvbG9yOiAjMzMzOyAvKiBEYXJrIGdyYXkgdGV4dCBjb2xvciAqLwogICAgICAgICAgICB9CiAgICAgICAgICAgIGgxIHsKICAgICAgICAgICAgICAgIGNvbG9yOiAjMDA3YmZmOyAvKiBCbHVlIGNvbG9yIGZvciBoZWFkaW5ncyAqLwogICAgICAgICAgICB9CiAgICAgICAgICAgIHAgewogICAgICAgICAgICAgICAgY29sb3I6ICM2Yzc1N2Q7IC8qIEdyYXkgY29sb3IgZm9yIHBhcmFncmFwaHMgKi8KICAgICAgICAgICAgfQogICAgICAgIDwvc3R5bGU+CiAgICA8L2hlYWQ+CiAgICA8Ym9keT4KICAgICAgICA8ZGl2IGNsYXNzPSJjb250ZW50Ij4KICAgICAgICAgICAgPGgxPkhlbGxvLCBXb3JsZCE8L2gxPgogICAgICAgICAgICA8cD5XZSBoYXZlIGp1c3QgY29uZmlndXJlZCBvdXIgRmxhc2sgYXBwbGljYXRpb24hPC9wPgogICAgICAgIDwvZGl2PgogICAgPC9ib2R5PgogICAgPC9odG1sPgogICAgJycnCkBhcHAucm91dGUoJy9oZWFsdGgnKQpkZWYgaGVhbHRoX2NoZWNrKCk6CiAgICByZXR1cm4gJ0hlYWx0aHkhXG4nLCAyMDAKCmlmIF9fbmFtZV9fID09ICdfX21haW5fXyc6CiAgICBhcHAucnVuKGhvc3Q9JzAuMC4wLjAnLCBkZWJ1Zz1UcnVlKQpFT0YKCm5vaHVwIHB5dGhvbjMgaGVsbG9fd29ybGQucHkgPiBmbGFzay5sb2cgMj4mMSAmCg=="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + name = "app-server-instance-profile"
        }
    }

  # module.application.aws_launch_template.web_asg_launch_template will be created
  + resource "aws_launch_template" "web_asg_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "The launch template for the web auto scaling group"
      + id                     = (known after apply)
      + image_id               = "ami-07d9b9ddc6cd8dd30"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = "web-server-asg-launch-template"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Name" = "web-server-asg-launch-template"
        }
      + tags_all               = {
          + "Name"        = "web-server-asg-launch-template"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + user_data              = "IyEvYmluL2Jhc2gKCnNldCAtZQoKc3VkbyBhcHQgdXBkYXRlCnN1ZG8gYXB0IGluc3RhbGwgLXkgbmdpbnggYXdzY2xpCgppZiAhIGNvbW1hbmQgLXYgYXdzICY+L2Rldi9udWxsOyB0aGVuCiAgICBlY2hvICJBV1MgQ0xJIGlzIG5vdCBpbnN0YWxsZWQuIEV4aXRpbmcuLi4iID4+IHVzZXJkYXRhX2Vycm9ycy5sb2cKICAgIGV4aXQgMQpmaQoKZXhwb3J0IE5HSU5YX0NPTkZJR19GSUxFPSIvZXRjL25naW54L25naW54LmNvbmYiCmV4cG9ydCBBUFBfTEJfRE5TX05BTUU9JChhd3MgZWxidjIgZGVzY3JpYmUtbG9hZC1iYWxhbmNlcnMgLS1uYW1lcyAiYXBwLXNlcnZlci1sYiIgLS1yZWdpb24gInVzLWVhc3QtMSIgLS1xdWVyeSAnTG9hZEJhbGFuY2Vyc1swXS5ETlNOYW1lJyAtLW91dHB1dCB0ZXh0KQoKaWYgWyAteiAiJEFQUF9MQl9ETlNfTkFNRSIgXTsgdGhlbgogICAgZWNobyAiRmFpbGVkIHRvIHJldHJpZXZlIGludGVybmFsIGxvYWQgYmFsYW5jZXIgRE5TIG5hbWUuIEV4aXRpbmcuLi4iID4+IHVzZXJkYXRhX2Vycm9ycy5sb2cKICAgIGV4aXQgMQpmaQoKc3VkbyBiYXNoIC1jICJjYXQgPiAkTkdJTlhfQ09ORklHX0ZJTEUiIDw8RU9GCndvcmtlcl9wcm9jZXNzZXMgMTsKZXZlbnRzIHsKICB3b3JrZXJfY29ubmVjdGlvbnMgIDEwMjQ7Cn0KaHR0cCB7CiAgaW5jbHVkZSAgICAgICAvZXRjL25naW54L21pbWUudHlwZXM7CiAgZGVmYXVsdF90eXBlICBhcHBsaWNhdGlvbi9vY3RldC1zdHJlYW07CiAgc2VuZGZpbGUgICAgICAgIG9uOwogIHRjcF9ub3B1c2ggICAgIG9uOwogIGtlZXBhbGl2ZV90aW1lb3V0ICA2NTsKICBnemlwICBvbjsKICBzZXJ2ZXJfdG9rZW5zIG9mZjsKICBzZXJ2ZXIgewogICAgbGlzdGVuIDgwOwogICAgc2VydmVyX25hbWUgXzsKICAgIGFjY2Vzc19sb2cgb2ZmOwogICAgbG9jYXRpb24gLyB7CiAgICAgIHByb3h5X3Bhc3MgaHR0cDovLyRBUFBfTEJfRE5TX05BTUU6NTAwMDsKICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Ib3N0IFwkaHR0cF9ob3N0OwogICAgICBwcm94eV9zZXRfaGVhZGVyIFgtUmVhbC1JUCBcJHJlbW90ZV9hZGRyOwogICAgICBwcm94eV9zZXRfaGVhZGVyIFgtRm9yd2FyZGVkLVByb3RvIFwkc2NoZW1lOwogICAgICBhZGRfaGVhZGVyIFAzUCAnQ1A9IkFMTCBEU1AgQ09SIFBTQWEgUFNEYSBPVVIgTk9SIE9OTCBVTkkgQ09NIE5BViInOwogICAgfQogICAgbG9jYXRpb24gL2hlYWx0aCB7CiAgICAgIHJldHVybiAyMDAgIkhlYWx0aHkhXG4iOyAKICAgIH0KICB9Cn0KRU9GCgpzdWRvIG5naW54IC10CgppZiBbICQ/IC1lcSAwIF07IHRoZW4KICAgIHN1ZG8gc3lzdGVtY3RsIHJlbG9hZCBuZ2lueAplbHNlCiAgICBlY2hvICJOZ2lueCBjb25maWd1cmF0aW9uIHRlc3QgZmFpbGVkLiBQbGVhc2UgY2hlY2sgdGhlIGNvbmZpZ3VyYXRpb24gZmlsZS4iID4+IHVzZXJkYXRhX2Vycm9ycy5sb2cKZmk="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + name = "web-server-instance-profile"
        }
    }

  # module.application.aws_lb.app_lb will be created
  + resource "aws_lb" "app_lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "app-server-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "app-server-lb"
        }
      + tags_all                                                     = {
          + "Name"        = "app-server-lb"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.application.aws_lb.web_lb will be created
  + resource "aws_lb" "web_lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "web-server-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "web-server-lb"
        }
      + tags_all                                                     = {
          + "Name"        = "web-server-lb"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.application.aws_lb_listener.app_lb_listener will be created
  + resource "aws_lb_listener" "app_lb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 5000
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name" = "app-server-lb-listener"
        }
      + tags_all          = {
          + "Name"        = "app-server-lb-listener"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.application.aws_lb_listener.web_lb_listener will be created
  + resource "aws_lb_listener" "web_lb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name" = "web-server-listener"
        }
      + tags_all          = {
          + "Name"        = "web-server-listener"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.application.aws_lb_target_group.app_load_balancer_tg will be created
  + resource "aws_lb_target_group" "app_load_balancer_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "app-server-tg"
      + name_prefix                        = (known after apply)
      + port                               = 5000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "app-server-tg"
        }
      + tags_all                           = {
          + "Name"        = "app-server-tg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.application.aws_lb_target_group.web_load_balancer_tg will be created
  + resource "aws_lb_target_group" "web_load_balancer_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "web-server-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "web-server-tg"
        }
      + tags_all                           = {
          + "Name"        = "web-server-tg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.application.aws_security_group.app_launch_template_sg will be created
  + resource "aws_security_group" "app_launch_template_sg" {
      + arn                    = (known after apply)
      + description            = "The security group for the app launch template"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "app-server-launch-template-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-server-launch-template-sg"
        }
      + tags_all               = {
          + "Name"        = "app-server-launch-template-sg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.application.aws_security_group.app_load_balancer_sg will be created
  + resource "aws_security_group" "app_load_balancer_sg" {
      + arn                    = (known after apply)
      + description            = "The security group for the app load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "app-server-lb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-server-lb-sg"
        }
      + tags_all               = {
          + "Name"        = "app-server-lb-sg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.application.aws_security_group.web_launch_template_sg will be created
  + resource "aws_security_group" "web_launch_template_sg" {
      + arn                    = (known after apply)
      + description            = "The security group for the web launch template"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "web-server-launch-template-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-server-launch-template-sg"
        }
      + tags_all               = {
          + "Name"        = "web-server-launch-template-sg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.application.aws_security_group.web_load_balancer_sg will be created
  + resource "aws_security_group" "web_load_balancer_sg" {
      + arn                    = (known after apply)
      + description            = "The security group for the public facing load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "web-server-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-server-sg"
        }
      + tags_all               = {
          + "Name"        = "web-server-sg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.application.aws_security_group_rule.allow_health_check_from_web_lb will be created
  + resource "aws_security_group_rule" "allow_health_check_from_web_lb" {
      + description              = "Allows HTTP from web load balancer"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.application.aws_security_group_rule.allow_health_check_probing will be created
  + resource "aws_security_group_rule" "allow_health_check_probing" {
      + description              = "Allows HTTP"
      + from_port                = 5000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5000
      + type                     = "ingress"
    }

  # module.application.aws_security_group_rule.allow_http_from_anywhere will be created
  + resource "aws_security_group_rule" "allow_http_from_anywhere" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTP from internet"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.application.aws_security_group_rule.allow_http_from_app_sg will be created
  + resource "aws_security_group_rule" "allow_http_from_app_sg" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.application.aws_security_group_rule.allow_http_to_anywhere will be created
  + resource "aws_security_group_rule" "allow_http_to_anywhere" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTP anywhere"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.application.aws_security_group_rule.allow_http_to_internet_from_web_server will be created
  + resource "aws_security_group_rule" "allow_http_to_internet_from_web_server" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTP to internet"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.application.aws_security_group_rule.allow_https_from_app_sg will be created
  + resource "aws_security_group_rule" "allow_https_from_app_sg" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTPs"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.application.aws_security_group_rule.allow_https_to_anywhere will be created
  + resource "aws_security_group_rule" "allow_https_to_anywhere" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTPs to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.application.aws_security_group_rule.allow_port_5000_from_web_sg will be created
  + resource "aws_security_group_rule" "allow_port_5000_from_web_sg" {
      + description              = "Allows HTTP 5000 from the web security group"
      + from_port                = 5000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5000
      + type                     = "ingress"
    }

  # module.application.aws_security_group_rule.allow_port_5000_to_app_lb will be created
  + resource "aws_security_group_rule" "allow_port_5000_to_app_lb" {
      + description              = "Allows HTTP egress"
      + from_port                = 5000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5000
      + type                     = "egress"
    }

  # module.application.aws_security_group_rule.allows_https_to_internet_from_web_server will be created
  + resource "aws_security_group_rule" "allows_https_to_internet_from_web_server" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.application.aws_security_group_rule.app_health_check_probing will be created
  + resource "aws_security_group_rule" "app_health_check_probing" {
      + description              = "Allows HTTP"
      + from_port                = 5000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5000
      + type                     = "egress"
    }

  # module.application.random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.networking.aws_eip.nat_gw_ip[0] will be created
  + resource "aws_eip" "nat_gw_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "web-app-infra-eip-0"
        }
      + tags_all             = {
          + "Name"        = "web-app-infra-eip-0"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_eip.nat_gw_ip[1] will be created
  + resource "aws_eip" "nat_gw_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "web-app-infra-eip-1"
        }
      + tags_all             = {
          + "Name"        = "web-app-infra-eip-1"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "web-app-infra-igw"
        }
      + tags_all = {
          + "Name"        = "web-app-infra-igw"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "web-app-infra-nat-gw-0"
        }
      + tags_all                           = {
          + "Name"        = "web-app-infra-nat-gw-0"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.networking.aws_nat_gateway.nat_gw[1] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "web-app-infra-nat-gw-1"
        }
      + tags_all                           = {
          + "Name"        = "web-app-infra-nat-gw-1"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.networking.aws_route.default_routes[0] will be created
  + resource "aws_route" "default_routes" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.networking.aws_route.default_routes[1] will be created
  + resource "aws_route" "default_routes" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.networking.aws_route_table.route_tables[0] will be created
  + resource "aws_route_table" "route_tables" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "web-app-infra-public-rtb"
        }
      + tags_all         = {
          + "Name"        = "web-app-infra-public-rtb"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.route_tables[1] will be created
  + resource "aws_route_table" "route_tables" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "web-app-infra-private-rtb"
        }
      + tags_all         = {
          + "Name"        = "web-app-infra-private-rtb"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_app_subnets[0] will be created
  + resource "aws_route_table_association" "private_rtb_app_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_app_subnets[1] will be created
  + resource "aws_route_table_association" "private_rtb_app_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_cache_subnets[0] will be created
  + resource "aws_route_table_association" "private_rtb_cache_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_cache_subnets[1] will be created
  + resource "aws_route_table_association" "private_rtb_cache_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_db_subnets[0] will be created
  + resource "aws_route_table_association" "private_rtb_db_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_db_subnets[1] will be created
  + resource "aws_route_table_association" "private_rtb_db_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rtb_public_subnets[0] will be created
  + resource "aws_route_table_association" "public_rtb_public_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rtb_public_subnets[1] will be created
  + resource "aws_route_table_association" "public_rtb_public_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rtb_web_subnets[0] will be created
  + resource "aws_route_table_association" "public_rtb_web_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rtb_web_subnets[1] will be created
  + resource "aws_route_table_association" "public_rtb_web_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_subnet.app[0] will be created
  + resource "aws_subnet" "app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.app[1] will be created
  + resource "aws_subnet" "app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.cache[0] will be created
  + resource "aws_subnet" "cache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.cache[1] will be created
  + resource "aws_subnet" "cache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.db[0] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.db[1] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.web[0] will be created
  + resource "aws_subnet" "web" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.web[1] will be created
  + resource "aws_subnet" "web" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.web_app will be created
  + resource "aws_vpc" "web_app" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = false
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "web-app-infra-vpc"
        }
      + tags_all                             = {
          + "Name"        = "web-app-infra-vpc"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.networking.random_shuffle.az_names will be created
  + resource "random_shuffle" "az_names" {
      + id           = (known after apply)
      + input        = [
          + "us-east-1a",
          + "us-east-1b",
          + "us-east-1c",
          + "us-east-1d",
          + "us-east-1e",
          + "us-east-1f",
        ]
      + result       = (known after apply)
      + result_count = 2
    }

Plan: 65 to add, 0 to change, 0 to destroy.
```
</details> 